performance/configs/capturingUserDetails.yml
config:
  target: "https://httpbin.io/"
  phases:
    - duration: 1
      arrivalRate: 1
      name: Artillery First Capturing User Data Test
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          json:
            name: "FirstName"
            second name: "SecondName"
            location: "location"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
      - log: "Json value from response is: {{request_body}}"
      - log: "Host value from response is: {{host}}"